In [2]:
import numpy as np 
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
#Data framrs are just a bunch of series that share an index 
df = pd.DataFrame(randn(5,4), index = ['a','b','c','d','e'], columns= ['w','x','y','z'])

In [5]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [6]:
#extract a series 
df["w"]

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [7]:
# here you will be getting bac a data frame
df[["w","z"]]

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [8]:
# creating a new columns 
df["New"] = df["w"] + df["y"]

In [9]:
df

          w         x         y         z       New
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [10]:
#remove a column 
df.drop("New", axis =1, inplace = True)

In [11]:
#this is not an inplace effect because pandas wants to make sure you have not lost your data 
#you need to set the INPLACE parameter to True 
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [12]:
#drop a row form the data frame
df.drop("e", inplace = True)

In [13]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [14]:
#call items from the rows but iloc and loc 
df.loc["a"]
#calls fro mthe index name

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [15]:
#calles for mthe index 
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [16]:
#get a value from the daa frame 
df.loc["b","x"]

-0.31931804459303326

In [19]:
#get a subset of the frame 
df.loc[["a","b"],["x",'z']]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965

In [20]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [21]:
new_new = df[df["w"] > 0]

In [22]:
new_new

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [23]:
#indexing -> and resetting 
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [28]:
#does not orrurr in place -> you have to indicate "inplace" to rue
df.reset_index(inplace = True)

In [29]:
df

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057

In [30]:
df.set_index("index", inplace = True)

In [31]:
df

              w         x         y         z
index
a      2.706850  0.628133  0.907969  0.503826
b      0.651118 -0.319318 -0.848077  0.605965
c     -2.018168  0.740122  0.528813 -0.589001
d      0.188695 -0.758872 -0.933237  0.955057

In [ ]:
#Create new index